app/views/users/show.html.erb

  <ul>
    <% @user.locations.each do |location| %>
---
SELECT "locations".* FROM "locations" INNER JOIN "stories" ON "locations"."story_id" = "stories"."id" WHERE "stories"."user_id" = ?  [["user_id", 1]]