app/views/users/show.html.erb

   <div class="btn-wrapper">
      <p><% @user.stories.each do |story| %>
---
SELECT "stories".* FROM "stories" WHERE "stories"."user_id" = ?  [["user_id", 1]]