app/controllers/events_controller.rb

   def create
      @event = Event.create(safe_params)
      @user = User.find(params[:user_id])
---
INSERT INTO "events" ("name", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "San Diego, CA"], ["latitude", 32.8245525], ["longitude", -117.0951632], ["created_at", "2015-05-23 18:25:14.340350"], ["updated_at", "2015-05-23 18:25:14.340350"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]