app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations"
---
  def index
    @locations = Location.all

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "users".* FROM "users" WHERE "users"."locations_id" IS NULL LIMIT 1
---
  def show
    @location = Location.find(params[:id])
    @story = Story.find(params[:story_id])
    @user = User.find(params[:user_id])

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    @location = Location.find(params[:id])
    @story = Story.find(params[:story_id])
    @user = User.find(params[:user_id])

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "locations" ("name", "address", "description", "story_id", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @location = Location.new(strong_params)
    @story = Story.find(params[:story_id])
    @user = User.find(params[:user_id])
    @location.story_id = @story.id

    respond_to do |format|
      if @location.save

UPDATE "locations" SET "name" = ?, "longitude" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["name", "NYC -edited"], ["longitude", -74.0059413], ["updated_at", "2015-05-24 20:38:19.004709"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @location.update(strong_params)

DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 2]]
---
  def destroy
    @location.destroy

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_location
      @location = Location.find(params[:id])