app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories"
---
  def index
    @user = current_user
    @stories = Story.all

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 12]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def show
    @story = Story.find(params[:id])
    @user = User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def new
    @story = Story.new
    @user = User.find(params[:user_id])

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def edit
    @story = Story.find(params[:id])
    @user = User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "stories" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "The burrito I ate for lunch"], ["description", "I bought it at a restaurant"], ["user_id", 1], ["created_at", "2015-05-27 17:45:16.973807"], ["updated_at", "2015-05-27 17:45:16.973807"]]
---
  def create
    @story = Story.new(strong_params)
    @user = User.find(params[:user_id])
    @story.user_id = @user.id

    respond_to do |format|
      if @story.save

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 12]]
---
  def markers
    @story = Story.find(params[:id])

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_story
      @story = Story.find(params[:id])